python-course/part3_1.html
<!doctype html>
<html lang="en">
<head>
<title>Baustein 3 Meeting 1</title>
<!-- 2021-09-05 Sun 16:56 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="Falco Winkler">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
<link rel="stylesheet" type="text/css" href="css/python_course.css">

</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-3 col-md-push-9"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">1. Warmup</a>
<ul class="nav">
<li><a href="#sec-1-1">1.1. Übung: FLAME game</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Objektorientierte Programmierung</a>
<ul class="nav">
<li><a href="#sec-2-1">2.1. Wiederholung der Basics</a></li>
<li><a href="#sec-2-2">2.2. Übung (Funktionen+Objekte): Trip-Kosten</a></li>
</ul>
</li>
</ul>
</div>
</nav>
</div><div class="col-md-9 col-md-pull-3"><h1 class="title">Baustein 3 Meeting 1</h1>
<p>
Willkommen zum Python Kurs 3! In den vier Terminen geht es darum Python in der Tiefe kennenzulernen, 
aber auch genereller um das algorithmische Lösen von Problemen.
</p>

<ul class="org-ul">
<li>Ich verwende im Kurs die IDE <a href="https://thonny.org">thonny</a>, welche gut für Anfänger geeignet ist. Ihr könnt aber gerne eure eigene Entwicklungsumgebung verwenden.
</li>
<li>Bei Abwesenheit können wir die Sitzungen aufnehmen (wenn alle einverstanden sind), sagt einfach bescheid.
</li>
<li>Wie auch in den letzten Kursen ist ein Teil der Übungen von <a href="http://www.codewars.com/r/iQ48PQ">codewars</a> "katas" inspiriert. Diese sind entsprechend verlinkt. Ihr könnt gerne auch auf der Website trainieren (<a href="http://www.codewars.com/r/iQ48PQ"><b>klick</b></a>), um zu prüfen ob eure Lösungen korrekt sind, und andere Lösungen zu sehen, müsst es aber nicht.
</li>
</ul>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Warmup</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Übung: FLAME game</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Schreibt eine Funktion <code>flame_game(name1, name2)</code>, welche zwei Namen als Zeichenkette entgegennimmt,
und dann den Status der Liebesbeziehung zwischen diesen zwei Namen ausgibt.
</p>

<p>
Der Status wird so berechnet:
</p>

<ul class="org-ul">
<li>Erst werden alle Buchstaben entfernt die in beiden Zeichenketten enthalten sind 
</li>
</ul>
<p>
(Groß-Kleinschreibung wird nicht beachtet).
</p>
<ul class="org-ul">
<li>Die Länge der beiden Zeichenketten wird addiert.
</li>
<li>Die Entstehende Zahl wird verwendet um die Antwortoption auszugeben.
</li>
</ul>
<p>
Ist die Zahl größer als 6 geht es wieder von vorne los.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #7590db;">F</span> = Friendship <span style="color: #4f97d7;">(</span><span style="color: #a45bad;">1</span><span style="color: #4f97d7;">)</span>
<span style="color: #7590db;">L</span> = Love <span style="color: #4f97d7;">(</span><span style="color: #a45bad;">2</span><span style="color: #4f97d7;">)</span>
<span style="color: #7590db;">A</span> = Affection <span style="color: #4f97d7;">(</span><span style="color: #a45bad;">3</span><span style="color: #4f97d7;">)</span>
<span style="color: #7590db;">M</span> = Marriage <span style="color: #4f97d7;">(</span><span style="color: #a45bad;">4</span><span style="color: #4f97d7;">)</span>
<span style="color: #7590db;">E</span> = Enemies <span style="color: #4f97d7;">(</span><span style="color: #a45bad;">5</span><span style="color: #4f97d7;">)</span>
<span style="color: #7590db;">S</span> = Siblings <span style="color: #4f97d7;">(</span><span style="color: #a45bad;">6</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<p>
Beispiel: 
</p>

<div class="org-src-container">

<pre class="src src-python">flame_game<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"NEIL"</span>, <span style="color: #2d9574;">"MAGDALENA"</span><span style="color: #4f97d7;">)</span> <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Enemies</span>
</pre>
</div>

<ul class="org-ul">
<li>Duplikate entfernen: I, MAGDAA
</li>
<li>Längen addieren: \(1 + 6 = 7\)
</li>
<li>7 Steht für "Friendship" (7 Ist hinter der 6, es geht also ab da von vorne los)
</li>
</ul>

<p>
<a href="https://www.codewars.com/kata/553e0c3c8b8c2e1745000005">(referenz, nur Java)</a>
</p>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Objektorientierte Programmierung</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Wiederholung der Basics</h3>
<div class="outline-text-3" id="text-2-1">
<p>
   Objektorientierte Programmierung bezeichnet ein Methode für die Strukturierung von Programmen.
Hierbei werden Zustände und Funktionalität in Objekte gekapselt und das Programm somit in
Komponenten aufgeteilt. Diese Vorgehensweise, richtig angewandt, verbessert die Wiederverwendbarkeit, Lesbarkeit 
und Wartbarkeit von Programmcode.
</p>

<p>
<a href="part1_4.html">Wiederholung aus Kurs 1</a>
</p>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Übung (Funktionen+Objekte): Trip-Kosten</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Die nächste Urlaubsplanung steht an, und ihr wollt mit euren Freunden eine Roadtrip in den USA machen.
Amerika hat komische Gesetze, zum Beispiel dass sich die Kosten eines Hotels (für eine Nacht) aus der Anzahl der Vokale
<code>(aeiou)</code> berechnet.
Dafür schreibt ihr erstmal eine Funktion <code>hotel_cost(hotel_name)</code> die die Anzahl von Vokalen im Namen zurück gibt.
Beispiel:
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span>hotel_cost<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"alabama inn"</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span> <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">5</span>
</pre>
</div>

<p>
Um die Nächte und Anzahl an Personen für den Trip zu speichern, habt ihr schon eine Klasse geschrieben:
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">Stay</span>:

    <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">__init__</span><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">self</span>, hotel, nights, people<span style="color: #4f97d7;">)</span>:
        <span style="color: #4f97d7; font-weight: bold;">self</span>.hotel = hotel
        <span style="color: #4f97d7; font-weight: bold;">self</span>.nights = nights
        <span style="color: #4f97d7; font-weight: bold;">self</span>.people = people
</pre>
</div>

<p>
Jetzt müsst ihr nur noch eine Funktion <code>trip_cost(stays)</code> schreiben, um die Gesamtkosten der Reise zu berechnen.
Beispiel:
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span>trip_cost<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">[</span>Stay<span style="color: #67b11d;">(</span><span style="color: #2d9574;">"alabama inn"</span>, <span style="color: #a45bad;">6</span>, <span style="color: #a45bad;">2</span><span style="color: #67b11d;">)</span>, Stay<span style="color: #67b11d;">(</span><span style="color: #2d9574;">"kentucky ranch"</span>, <span style="color: #a45bad;">3</span>, <span style="color: #a45bad;">5</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">]</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span> <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">105</span>
</pre>
</div>

<p>
Tipps:
</p>
<ul class="org-ul">
<li>Um auf ein Attribut eines Objekts zuzugreifen, einfach die Punktnotation verwenden:
</li>
</ul>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #7590db;">my_stay</span> = Stay<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"alabama inn"</span>, <span style="color: #a45bad;">6</span>, <span style="color: #a45bad;">2</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span>my_stay.hotel<span style="color: #4f97d7;">)</span>
</pre>
</div>

<ul class="org-ul">
<li>Um zu prüfen ob ein Buchstabe ein Vokal ist:
</li>
</ul>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"a"</span> <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #2d9574;">"aeiou"</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"c"</span> <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #2d9574;">"aeiou"</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
True
False
</pre>
</div>
</div>
</div>
</div></div></div>
</body>
</html>
